___
# Ciência dos Dados - PROJETO 1

### Victor Arruda Niubó e Bruno Morales Balkins

## Perfil das mulheres como chefes de família:

___
## Introdução


Nesse projeto iremos analisar o perfil de mulheres no papel de chefes de família e comparar com homens no mesmo papel, para isso escolhemos as seguintes variáveis do banco de dados:
    - V0302: Sexo.
    - V8005: Idade.
    - V0402: Condição na familia
    - V4704: Condição de atividade na semana de referência para pessoas de 10 anos ou mais de idade.
    - V4805: Condição de ocupação na semana de referência para pessoas de 10 anos ou mais de idade.
    - V4706: Posição na ocupação no trabalho principal da semana de referência para pessoas de 10 anos ou mais de 
    idade.

___
## Filtros da base de dados

In [53]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import os

In [54]:
dados = pd.read_csv('PES2015.csv',sep=',')

In [63]:
#Filtro de dados:

dados_filtrados = dados.loc[(dados.V0302)|(dados.V8005)|(dados.V0402)|(dados.V4704)|(dados.V4805)|(dados.V4706), \
          ['V0302','V8005','V0402','V4704','V4805','V4706']]

#Mudando nomes das colunas:

dados_filtrados.rename(columns={'V0302':'Sexo','V8005':'Idade','V0402':'Condicao_familia',\
                                'V4704':'Atividade_na_semana','V4805':'Ocupação_na_semana',\
                                'V4706':'Posicao_no_Trabalho'}, inplace=True)
dados_filtrados.head(2)

,Sexo,Idade,Condicao_familia,Atividade_na_semana,Ocupação_na_semana,Posicao_no_Trabalho,Filhos
0,2,23,1,1.0,1.0,4.0,NaN
1,4,23,1,1.0,1.0,1.0,3.0

In [69]:
df2 = dados_filtrados.dropna(subset = ['Atividade_na_semana','Ocupação_na_semana','Posicao_no_Trabalho'])

In [71]:
df2.sort_values(by='Sexo', ascending=False).head(5)

,Sexo,Idade,Condicao_familia,Atividade_na_semana,Ocupação_na_semana,Posicao_no_Trabalho,Filhos
187447,4,29,2,1.0,1.0,3.0,3.0
200715,4,50,2,1.0,1.0,9.0,1.0
200834,4,22,4,1.0,1.0,1.0,1.0
200833,4,32,3,1.0,1.0,7.0,1.0
200827,4,38,1,1.0,1.0,7.0,1.0

In [72]:
df2[df2.Sexo==4].Sexo.value_counts()

4    70337
Name: Sexo, dtype: int64

In [73]:
df2[df2.Sexo==2].Sexo.value_counts()

2    94856
Name: Sexo, dtype: int64

In [74]:
pd.crosstab(index=[df2.Sexo], columns=[df2.Posicao_no_Trabalho])

Posicao_no_Trabalho,1.0,2.0,3.0,4.0,6.0,7.0,9.0,10.0,11.0,12.0,13.0
Sexo,,,,,,,,,,,
2,37871,636,5177,15609,432,496,25974,4270,2610,162,1619
4,24457,54,7578,8092,3099,7038,12526,1668,3432,29,2364

In [75]:
pd.crosstab(index=[df2.Sexo], columns=[df2.Atividade_na_semana])

Atividade_na_semana    1.0
Sexo
2                    94856
4                    70337

In [76]:
pd.crosstab(index=[df2.Sexo], columns=[df2.Condicao_familia])

Condicao_familia      1      2      3     4    5    6    7  8
Sexo
2                 55719  14300  20054  4145  467  154   15  2
4                 25713  29844  11329  2901  300  118  132  0

___
## Análise e Resultados

___
## Conclusão

Descreva aqui suas conclusões!